"""
运算符学习
    1.运算符的分类
        算数运算符
        赋值运算符
        复合赋值运算符
        比较运算符
        逻辑运算符
    2.数学运算符
        2.1 优先级：()高于**高于*、/、//、%高于+、-
    3.赋值运算符
        3.1 多变量赋值
    4.复合赋值运算符(根本：先进行算数运算符，再进行复制运算符)
        +=
        -=
        *=
        /=
        //=
        %=
        **=
    5.逻辑运算符
        and  相当于Java中的&&
        or   相当于Java中的||
        not  相当于Java中的!
"""
a = 0
b = 1
c = 2
d = 0
# and 运算符，只要有一个数字为0，则结果返回0；否则返回最后一个非0数字
print(a and b)
print(b and c)
print(c and b)
# or 运算符，只有所有数字都为0才返回0；否则返回第一个非0数字
print(a or b)
print(b or c)
print(c or b)
print(a or d)
print('***********************')

n2 = 10
n2 *= 1+2
print(n2)
print('***********************')

n1, f1, s1 = 1, 1.1, 's1'
print(f'n1={n1},f1={f1},s1={s1}')

print('***********************')
# 除法
print(10/3)
print(10/2)
# 整除
print(10//3)
# 幂函数
print(2**3)

# 优先级判断
print(2 * 3 ** 2)

"""
运算结果：
3.3333333333333335
5.0
3
8
"""


